import 'package:flutter/material.dart';
import 'package:pray_training/pray_list.dart';

class PrayForChurch extends StatelessWidget {
  @override
  Widget build(BuildContext context) {
    // TODO: implement build
    final Object? args = ModalRoute.of(context)!.settings.arguments;

    final String prayContent =
        '1) 하나님 아버지는 거룩하십니다.\n'
        '하나님 아버지의 이름이 우리 교회를 통하여 거룩히 여김 받으시기를 원합니다.\n'
        '그리고 우리 교회가 하나님의 이름을 거룩하게 할 일만 하게 하옵소서.\n'
        '\n'
        '2) 하나님의 나라가 우리 교회에 이루어지기를 원합니다.\n'
        '그리하여 의와 평강과 희락이 넘치는 교회가 되어 교회 천국이 이루어지게 하옵소서.\n'
        '또한 우리 교회를 통치하셔서 하나님의 말씀대로 세워지게 하옵시고 하나님이 기뻐하는 교회가 되게 하옵소서.\n'
        '그리고 우리 교회를 통하여 하나님의 나라가 이웃과 지역사회와 세상 모든 사람들에게 전파되기를 원합니다.\n'
        '\n'
        '3) 하나님의 뜻이 하늘에서 이루어진 것 같이 땅에서 우리 교회를 통하여 이루어지기를 원합니다.\n'
        '또 우리 교회가 하나님의 뜻을 알고 이루어 드리기를 기도합니다.\n'
        '하나님의 뜻이 우리 교회를 통하여 모든 민족에게 증거되기를 원합니다.\n'
        '\n'
        '4) 하나님게서 우리 교회에 필요한 것을 공급해 주시기를 원합니다.\n'
        '우리 교회 다임목사님의 건강을 지켜 주옵소서.\n'
        '하나님의 뜻을 이루어 드리는 능력의 사자로 사용하여 주옵소서.\n'
        '또 우리 교회의 목표가 이루어지게 하옵소서.\n'
        '\n'
        + 'withpray' +
        '우리 교회가 지역의 영혼들을 많이 구원하는 교회가 되기를 원합니다.\n'
        '그리고 영적 추수할 릭더를 만들고 번식하는 교회가 되게 하옵소서.\n'
            '우리 교회 부교역자들과 중진들이 담임목사님을 도와서 하나님의 뜻을 이루게 하옵소서.\n'
            '또한 그들이 성령 충만하고 말씀에 충만하여 능력으로 하나님의 큰 뜻을 이루게 하옵소서.\n'
            '우리 교인들이 하나님을 잘 섬기고 복 받는 사람들이 되기를 원합니다.\n'
            '\n'
            '5) 하나님! 다른 사람의 죄를 용서해 주시기 원합니다.\n'
            '우리 교회에 상처를 주고 힘들게 했던 사람들을 용서합니다.\n'
            '예수님의 이름으로 용서합니다.\n'
            '그리고 그들의 영혼을 축복해 주옵소서.\n'
            '그들이 하나님을 경외하고 복 받기를 원합니다.\n'
            '\n'
            '6) 하나님! 다른 살마의 죄를 용서해 준 것 같이 우리 교회의 죄를 사하여 주옵소서.\n'
            '하나님만이 죄를 사하는 권세가 있는 줄 믿습니다.\n'
            '\n'
            '7) 하나님! 우리 교회가 시험에 들지 않기를 원합니다.\n'
            '마귀에게 시험당하지 않기를 원합니다.\n'
            '세상으로부터 시험당하지 않기를 원합니다.\n'
            '신앙 생활에 시험 들지 않기를 원합니다.\n'
            '교회생활에 시험 들지 않기를 원합니다.\n'
            '물질로 시험 당하지 않기를 원합니다.\n'
            '사람들로 인하여 시험 들지 않기를 원합니다.\n'
            '여러 가지 시험에 들지 않도록 하옵소서.\n'
            '그리고 시험을 주는 마귀를 우리 교회에서 내쫓아 주옵시고, 다시는 들어오지 않게 하옵소서.\n'
            '천군 천사로 우리 교회를 지켜 주옵소서.\n'
            '\n'
            '8) 하나님! 우리 교회를 악에서 구원하여 주옵소서.\n'
            '우리 교회가 하나님의 법을 어기는 악을 행하지 않게 하옵소서.\n'
            '우리 교회가 하나님의 말씀대로 행하여 선과 의를 행하게 하옵소서.\n'
            '우리 교회는 연약하오니 하나님게서 악을 이길 수 있는 힘과 능력을 공급하여 주옵소서.\n'
            '언제나 악에서 지켜주시고 악이 들어올 때 구원하여 주옵소서.\n'
            '\n'
            '9) 하나님의 나라와 권세와 영광이 영원히, 영원히 하나님 아버지께 있사오며,\n'
            '\n'
            '10) 예수님의 이름으로 기도드립니다. 아멘.';

    return Scaffold(
      appBar: AppBar(
        title: Text('Welcome test2'),
      ),
      drawer: PrayList(),
      body: Container(
        child: Center(
          child: Text(args.toString()),
        ),
      ),
    );
  }
}